back/app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT * FROM `games`

  def show
    @game = Game.find(params[:id])
---
SELECT * FROM `games` WHERE (`games`.`id` = 0)

  def edit
    @game = Game.find(params[:id])
---
SELECT * FROM `games` WHERE (`games`.`id` = 1)

  def create
	u = User.find_by_uuid(session[:user_uuid])
	params[:game][:owner_uuid] = u.uuid;
	params[:game][:player_uuid] = u.uuid;

	#turn_speed
	days = Integer(params[:date][:days]) * 24 * 60
	hours = Integer(params[:date][:hours]) * 60
	minutes = Integer(params[:date][:minutes])
	params[:game][:turn_speed_minutes] = days + hours + minutes

	m = Map.find_by_uuid(params[:game][:map_uuid])
	params[:game][:current_map] = m.data;

    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save
---
SELECT * FROM `users` WHERE (`users`.`uuid` = 'd40e52f8-429f-11df-a5dc-0026f2b76973') LIMIT 1
SELECT * FROM `maps` WHERE (`maps`.`uuid` = 'be8ecfd2-4404-11df-bdeb-0026f2b76973') LIMIT 1
INSERT INTO `games` (`uuid`, `owner_uuid`, `player_uuid`, `turn_expiration`, `turn_speed`, `map_uuid`, `current_map`, `created_at`, `updated_at`) VALUES('cb28fea0-4366-11df-bff5-0026f2b76973', 'asd', '', '2010-04-08 23:30:00', '2010-04-08 23:30:00', 'asdasdasd', x'617364617364617364', '2010-04-08 23:31:01', '2010-04-08 23:31:01')

  def destroy
    @game = Game.find(params[:id])
    @game.destroy
---
SELECT * FROM `games` WHERE (`games`.`id` = 1)
DELETE FROM `games` WHERE `id` = 1