back/app/controllers/maps_controller.rb

SELECT * FROM `maps`
---
	def index
		@maps = Map.all

SELECT * FROM `maps` WHERE (`maps`.`id` = 1)
---
	def show
		@map = Map.find(params[:id])

INSERT INTO `maps` (`uuid`, `data`, `name`, `players`, `created_at`, `updated_at`) VALUES('297c2be0-4dbb-11df-be85-0026f2b76973', x'48656c6c6f', 'Lakes', 10, '2010-04-22 03:00:09', '2010-04-22 03:00:09')
---
	def create
		@map = Map.new(params[:map])

		respond_to do |format|
			if @map.save

SELECT * FROM `maps` WHERE (`maps`.`id` = 4)
DELETE FROM `maps` WHERE `id` = 4
---
	def destroy
		@map = Map.find(params[:id])
		@map.destroy