back/app/controllers/user_controller.rb

SELECT user_uuid, game_uuid FROM `players` WHERE (`players`.`user_uuid` = 'd40e52f8-429f-11df-a5dc-0026f2b76973')
SELECT uuid, name, map_uuid FROM `games` WHERE (`games`.`uuid` IS NULL) LIMIT 1
---
	def index
		players = Player.get_game_uuids(session[:user_uuid])

		games = []
		players.each do |player|

INSERT INTO `players` (`uuid`, `user_uuid`, `game_uuid`, `created_at`, `updated_at`) VALUES('19689516-45bb-11df-9c24-0026f2b76973', 'd40e52f8-429f-11df-a5dc-0026f2b76973', '81bd2d8a-45a6-11df-9c24-0026f2b76973', '2010-04-11 22:39:33', '2010-04-11 22:39:33')
---
	def join
		params[:player] = {}
		params[:player][:game_uuid] = params[:game_uuid]
		params[:player][:user_uuid] = session[:user_uuid]

		@player = Player.new(params[:player])

		respond_to do |format|
			if @player.save