back/app/controllers/user_controller.rb

	def show_games
		game = Game.new
		games = game.get_games

		h = {}

		games.each do |g|
---
SELECT uuid, name, map_uuid FROM `games`