back/app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `hashed_password`, `salt`, `created_at`, `updated_at`, `uuid`) VALUES('tom', 'thomasuster@gmail.com', 'c8ce0c988922d1090d52fe1f2dbd92a87ccc7f8f', '336619360.517171734173404', '2010-04-07 23:46:49', '2010-04-07 23:46:49', 'd40e52f8-429f-11df-a5dc-0026f2b76973')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save